In [6]:
import pandas as pd

d = {'name': ['Adelya', 'Elina', 'Yaroslava', 'Adelya', 'Elina', 'Yaroslava'], 'activity': [45,11,30,13,30,23]}
df = pd.DataFrame(d)
df

        name  activity
0     Adelya        45
1      Elina        11
2  Yaroslava        30
3     Adelya        13
4      Elina        30
5  Yaroslava        23

In [9]:
#теперь мы хотим удалить все строчки где activity = 30
df = df.drop(df[df['activity']==30].index)
df

        name  activity
0     Adelya        45
1      Elina        11
3     Adelya        13
5  Yaroslava        23

In [10]:
#а как теперь удалить строчки, activity, которых встречается всего один раз? (это строчки 45, 11, 13, 23)
d = {'name': ['Adelya', 'Elina', 'Yaroslava', 'Adelya', 'Elina', 'Yaroslava'], 'activity': [45,11,30,13,30,23]}
df = pd.DataFrame(d)
df

        name  activity
0     Adelya        45
1      Elina        11
2  Yaroslava        30
3     Adelya        13
4      Elina        30
5  Yaroslava        23

In [20]:
#посчитаем сколько каждый раз встречается каждое значение (увидим что 30 встречается 2 раза, 13 - 1 и так далее)
tmp = df['activity'].value_counts()
tmp = pd.DataFrame(tmp)
tmp = tmp.reset_index()
# оставим только те которые встречаются один раз
tmp = tmp[tmp['activity'] != 1]
# сохраним номера этих activities  в список
l = list(tmp['index'])
l
# в данном случае у меня с именами тут беда, они местами поменялись
# activity - сколько раз встретилось данное число
#  index - само число(выведете это и проверьте)

# теперь мы сохранили номера activities которые встречаются больше одного раза

[30]

In [24]:
# давайте создадим новый датафремй который будет содержать только те строчки
# activity который встречается в данных больше одного раза
df.loc[df['activity'].isin(l)]

        name  activity
2  Yaroslava        30
4      Elina        30